import '../Model/NewsModel.dart';

List<NewsModel> news = [
  NewsModel(
      date: DateTime(2024, 6, 1),
      headName: 'Плановые отключения горячей воды',
      text:
          'Уважаемые жители! Сообщаем вам, что с 10 по 15 июня в нашем доме будет проведено плановое отключение горячей воды в связи с профилактическими работами на теплотрассе. Просим запастись необходимым количеством воды и приносим извинения за доставленные неудобства. Мы делаем все возможное, чтобы минимизировать время отключения и обеспечить комфортные условия проживания.',
      image:
          'https://sun9-50.userapi.com/impg/LrdkVWdJKp6HM5ijYjy5LxJ_wjVqZ65d2E0RQw/Ot1uU4bXJ_s.jpg?size=992x640&quality=95&sign=abc28d2dcc075a3d2ae8009afdff428e&type=album',
      isImage: true),
  NewsModel(
      date: DateTime(2024, 6, 4),
      headName: 'Собрание жильцов',
      text:
          'Уважаемые жильцы! Приглашаем вас на собрание, которое состоится 15 июня в 18:00 в нашем дворе. На повестке дня: обсуждение текущих вопросов по благоустройству, отчеты по выполненным работам и планы на будущее. Ваше мнение важно для нас! Ждем всех желающих принять участие в обсуждении.',
      image:
          'https://sevastopol-news.com/img/20230331/2e54a11af60be38903e923e854e6a59a.jpg',
      isImage: true),
  NewsModel(
      date: DateTime(2024, 6, 6),
      headName: 'Очистка вентиляционных каналов',
      text:
          'Уважаемые жители! Напоминаем, что 20 июня с 9:00 до 17:00 будут проводиться работы по очистке вентиляционных каналов. Просим вас обеспечить доступ в квартиры сотрудникам Управляющей компании. Очистка вентиляции необходима для поддержания качества воздуха и предотвращения возгораний. Благодарим за понимание.',
      image:
          'https://petropavlovskoe-pos-r20.gosweb.gosuslugi.ru/netcat_files/37/45/946c23cdae023d5dc6777322d1161a94.jpg',
      isImage: true),
  NewsModel(
      date: DateTime(2024, 6, 9),
      headName: 'Обновление детской площадки',
      text:
          'Дорогие жители! С радостью сообщаем, что с 25 июня начнутся работы по обновлению детской площадки во дворе нашего дома. Будут установлены новые игровые элементы и покрытия, а также проведено благоустройство прилегающей территории. Ожидаем завершения работ к 10 июля. Просим соблюдать осторожность в зоне проведения работ.',
      image: 'https://gazeta-chi.ru/uploads/entries/дп.jpg',
      isImage: true),
  NewsModel(
      date: DateTime(2024, 6, 13),
      headName: 'Установка видеонаблюдения',
      text:
          'Уважаемые жители! В целях повышения безопасности в нашем доме с 1 июля будет проводиться установка системы видеонаблюдения в подъездах и на территории двора. Камеры будут фиксировать все происходящее и обеспечивать дополнительный контроль за общественным порядком. Благодарим за понимание и поддержку.',
      image:
          'https://www.taggerd.su/files/files/sistema-bezopasnosti-mkd-23.jpg',
      isImage: true),
  NewsModel(
      date: DateTime(2024, 6, 15),
      headName: 'Профилактика лифтового оборудования',
      text:
          'Уважаемые жильцы! Сообщаем вам, что с 5 по 7 июля будут проводиться профилактические работы на лифтовом оборудовании. В это время возможны временные отключения лифтов. Просим воспользоваться лестницей и заранее планировать свои поездки. Приносим извинения за возможные неудобства.',
      image:
          'https://sun9-67.userapi.com/impg/nMcJHH7DTW2WvT_9zxre2rUj9roR4jPi3I9MBQ/a2_U1lPJTTA.jpg?size=1200x900&quality=96&sign=2066f4b089a45ec9e20a93856c08e580&c_uniq_tag=dMSZZW-qpK9e_vdFjJ0EdTXeCWb7TIvuHEbTvEV3HCo&type=album',
      isImage: true),
  NewsModel(
      date: DateTime(2024, 6, 16),
      headName: 'Замена ламп в подъездах',
      text:
          'Уважаемые жители! С 8 по 10 июля будет проводиться замена ламп освещения в подъездах на энергосберегающие. Просим вас сообщить в Управляющую компанию о неисправных лампах, чтобы мы могли оперативно их заменить. Новое освещение позволит улучшить видимость и снизить потребление электроэнергии.',
      image:
          'https://lh3.googleusercontent.com/cMmga5_DlZFsJkQAxjT8-afdUef3IFkjOBIZm7MteRy_N989MP9pvR2Ji9SlqHOAMomZIZZNqlIxFyahrU3KmONP9UEVUxeycR03DC5I83v_mE6rRzDqQYThxoOIdpVbPzwwwIB1=s1600',
      isImage: true),
  NewsModel(
      date: DateTime(2024, 6, 16),
      headName: 'Установка новых почтовых ящиков',
      text:
          'Уважаемые жильцы! Сообщаем вам, что с 12 по 14 июля будет проводиться замена старых почтовых ящиков на новые, более вместительные и удобные в использовании. Просим вас забрать всю корреспонденцию из старых ящиков до начала работ. Благодарим за сотрудничество.',
      image: '',
      isImage: false),
  NewsModel(
      date: DateTime(2024, 6, 18),
      headName: 'Проверка противопожарной безопасности',
      text:
          'Уважаемые жители! 25 июля будет проведена плановая проверка систем противопожарной безопасности в нашем доме. В ходе проверки будет осмотрено состояние пожарных лестниц, огнетушителей и сигнализации. Просим вас не загромождать эвакуационные выходы и коридоры, а также сообщить в Управляющую компанию о возможных неисправностях. Безопасность всех жителей – наш приоритет.',
      image: 'https://ppb-moscow.ru/assets/images/articles/proverka-signal.jpg',
      isImage: true),
  NewsModel(
      date: DateTime(2024, 6, 20),
      headName: 'Озеленение двора',
      text:
          'Дорогие жители! С радостью сообщаем, что в августе в нашем дворе начнутся работы по озеленению. Будет высажено более 30 деревьев и кустарников, разбиты цветочные клумбы. Приглашаем всех желающих принять участие в высадке растений. Вместе мы сделаем наш двор еще красивее и уютнее!',
      image:
          'https://pro-dachnikov.com/uploads/posts/2021-09/1632878361_57-pro-dachnikov-com-p-krasivie-dvori-mnogokvartirnikh-domov-foto-63.jpg',
      isImage: true),
  NewsModel(
      date: DateTime(2024, 6, 24),
      headName: 'Опрос по улучшению инфраструктуры',
      text:
          'Дорогие жильцы! Наша Управляющая компания проводит опрос среди жителей для определения приоритетных направлений улучшения инфраструктуры нашего дома и двора. Ваше мнение очень важно для нас! Просим вас пройти опрос по ссылке, размещенной на нашем сайте, или заполнить анкеты, которые будут размещены на информационных стендах в подъездах. Давайте вместе сделаем наш дом еще лучше!',
      image:
          'https://msfo.ru/upload/iblock/836/h791yr7qzjajwwkbxak0458mqjsxybq6.jpeg',
      isImage: true),
];
